{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null], "dtype": "string", "sparse": false, "ragged": false, "name": "text"}, "name": "text", "inbound_nodes": []}, {"class_name": "KerasLayer", "config": {"name": "preprocessing", "trainable": false, "dtype": "float32", "handle": "https://tfhub.dev/tensorflow/bert_en_uncased_preprocess/2"}, "name": "preprocessing", "inbound_nodes": [[["text", 0, 0, {}]]]}, {"class_name": "KerasLayer", "config": {"name": "BERT_encoder", "trainable": true, "dtype": "float32", "handle": "https://tfhub.dev/tensorflow/small_bert/bert_en_uncased_L-8_H-512_A-8/1"}, "name": "BERT_encoder", "inbound_nodes": [{"input_word_ids": ["preprocessing", 0, 2, {}], "input_type_ids": ["preprocessing", 0, 1, {}], "input_mask": ["preprocessing", 0, 0, {}]}]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["BERT_encoder", 0, 9, {}]]]}, {"class_name": "Dense", "config": {"name": "classifier", "trainable": true, "dtype": "float32", "units": 7, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "classifier", "inbound_nodes": [[["dropout", 0, 0, {}]]]}], "input_layers": [["text", 0, 0]], "output_layers": [["classifier", 0, 0]]}}, "training_config": {"loss": {"class_name": "CategoricalCrossentropy", "config": {"reduction": "auto", "name": "categorical_crossentropy", "from_logits": true, "label_smoothing": 0.0, "axis": -1}}, "metrics": [[{"class_name": "CategoricalAccuracy", "config": {"name": "categorical_accuracy", "dtype": "float32"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": true, "is_legacy_optimizer": false, "learning_rate": 9.999999747378752e-06, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of40.bin", "group1-shard2of40.bin", "group1-shard3of40.bin", "group1-shard4of40.bin", "group1-shard5of40.bin", "group1-shard6of40.bin", "group1-shard7of40.bin", "group1-shard8of40.bin", "group1-shard9of40.bin", "group1-shard10of40.bin", "group1-shard11of40.bin", "group1-shard12of40.bin", "group1-shard13of40.bin", "group1-shard14of40.bin", "group1-shard15of40.bin", "group1-shard16of40.bin", "group1-shard17of40.bin", "group1-shard18of40.bin", "group1-shard19of40.bin", "group1-shard20of40.bin", "group1-shard21of40.bin", "group1-shard22of40.bin", "group1-shard23of40.bin", "group1-shard24of40.bin", "group1-shard25of40.bin", "group1-shard26of40.bin", "group1-shard27of40.bin", "group1-shard28of40.bin", "group1-shard29of40.bin", "group1-shard30of40.bin", "group1-shard31of40.bin", "group1-shard32of40.bin", "group1-shard33of40.bin", "group1-shard34of40.bin", "group1-shard35of40.bin", "group1-shard36of40.bin", "group1-shard37of40.bin", "group1-shard38of40.bin", "group1-shard39of40.bin", "group1-shard40of40.bin"], "weights": [{"name": "word_embeddings/embeddings", "shape": [30522, 512], "dtype": "float32"}, {"name": "position_embedding/embeddings", "shape": [512, 512], "dtype": "float32"}, {"name": "type_embeddings/embeddings", "shape": [2, 512], "dtype": "float32"}, {"name": "embeddings/layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "embeddings/layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/query/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/query/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/key/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/key/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/value/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/value/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/attention_output/kernel", "shape": [8, 64, 512], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/attention_output/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_0/intermediate/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "transformer/layer_0/intermediate/bias", "shape": [2048], "dtype": "float32"}, {"name": "transformer/layer_0/output/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "transformer/layer_0/output/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_0/output_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_0/output_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/query/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/query/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/key/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/key/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/value/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/value/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/attention_output/kernel", "shape": [8, 64, 512], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/attention_output/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_1/intermediate/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "transformer/layer_1/intermediate/bias", "shape": [2048], "dtype": "float32"}, {"name": "transformer/layer_1/output/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "transformer/layer_1/output/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_1/output_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_1/output_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention/query/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention/query/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention/key/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention/key/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention/value/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention/value/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention/attention_output/kernel", "shape": [8, 64, 512], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention/attention_output/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_2/intermediate/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "transformer/layer_2/intermediate/bias", "shape": [2048], "dtype": "float32"}, {"name": "transformer/layer_2/output/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "transformer/layer_2/output/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_2/output_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_2/output_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention/query/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention/query/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention/key/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention/key/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention/value/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention/value/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention/attention_output/kernel", "shape": [8, 64, 512], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention/attention_output/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_3/intermediate/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "transformer/layer_3/intermediate/bias", "shape": [2048], "dtype": "float32"}, {"name": "transformer/layer_3/output/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "transformer/layer_3/output/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_3/output_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_3/output_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_4/self_attention/query/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_4/self_attention/query/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_4/self_attention/key/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_4/self_attention/key/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_4/self_attention/value/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_4/self_attention/value/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_4/self_attention/attention_output/kernel", "shape": [8, 64, 512], "dtype": "float32"}, {"name": "transformer/layer_4/self_attention/attention_output/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_4/self_attention_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_4/self_attention_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_4/intermediate/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "transformer/layer_4/intermediate/bias", "shape": [2048], "dtype": "float32"}, {"name": "transformer/layer_4/output/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "transformer/layer_4/output/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_4/output_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_4/output_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_5/self_attention/query/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_5/self_attention/query/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_5/self_attention/key/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_5/self_attention/key/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_5/self_attention/value/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_5/self_attention/value/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_5/self_attention/attention_output/kernel", "shape": [8, 64, 512], "dtype": "float32"}, {"name": "transformer/layer_5/self_attention/attention_output/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_5/self_attention_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_5/self_attention_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_5/intermediate/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "transformer/layer_5/intermediate/bias", "shape": [2048], "dtype": "float32"}, {"name": "transformer/layer_5/output/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "transformer/layer_5/output/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_5/output_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_5/output_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_6/self_attention/query/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_6/self_attention/query/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_6/self_attention/key/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_6/self_attention/key/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_6/self_attention/value/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_6/self_attention/value/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_6/self_attention/attention_output/kernel", "shape": [8, 64, 512], "dtype": "float32"}, {"name": "transformer/layer_6/self_attention/attention_output/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_6/self_attention_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_6/self_attention_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_6/intermediate/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "transformer/layer_6/intermediate/bias", "shape": [2048], "dtype": "float32"}, {"name": "transformer/layer_6/output/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "transformer/layer_6/output/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_6/output_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_6/output_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_7/self_attention/query/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_7/self_attention/query/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_7/self_attention/key/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_7/self_attention/key/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_7/self_attention/value/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_7/self_attention/value/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_7/self_attention/attention_output/kernel", "shape": [8, 64, 512], "dtype": "float32"}, {"name": "transformer/layer_7/self_attention/attention_output/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_7/self_attention_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_7/self_attention_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_7/intermediate/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "transformer/layer_7/intermediate/bias", "shape": [2048], "dtype": "float32"}, {"name": "transformer/layer_7/output/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "transformer/layer_7/output/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_7/output_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_7/output_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "pooler_transform/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "pooler_transform/bias", "shape": [512], "dtype": "float32"}, {"name": "Variable", "shape": [], "dtype": "bool"}, {"name": "classifier/kernel", "shape": [512, 7], "dtype": "float32"}, {"name": "classifier/bias", "shape": [7], "dtype": "float32"}]}]}